#ifndef __BUZZER_TEST_H
#define __BUZZER_TEST_H
#include <stdio.h>
#include <stdint.h>

/**********************************************************************
 * 函数名称： buzzer_test
 * 功能描述： 蜂鸣器测试函数
 * 输入参数： 无
 * 输出参数： 无
 * 返 回 值： 无
 ***********************************************************************/
void buzzer_test(void);

/**********************************************************************
 * 函数名称： input_test
 * 功能描述： 输入系统单元测试函数
 * 输入参数： 无
 * 输出参数： 无
 * 返 回 值： 无
 ***********************************************************************/
void input_test(void);

#endif /* __BUZZER_TEST_H */
